==================
Empty
==================

() -> std.None "" 

---

(source_file
  (expression
    (closure_definition
      (struct_definition)
      (identity_path
        (identifier)
        (identifier))
      (expression
        (string)))))

==================
With argument
==================

(argument: std.types.UInt) -> std.None "" 

---

(source_file
  (expression
    (closure_definition
      (struct_definition
        (struct_member
          (identifier)
          (declaration_type
            (expression
              (identity_path
                (identifier)
                (identifier)
                (identifier))))))
      (identity_path
        (identifier)
        (identifier))
      (expression
        (string)))))

==================
With Binary Expression
==================

(argument: std.types.UInt) -> std.None a + b 

---

(source_file
  (expression
    (closure_definition
      (struct_definition
        (struct_member
          (identifier)
          (declaration_type
            (expression
              (identity_path
                (identifier)
                (identifier)
                (identifier))))))
      (identity_path
        (identifier)
        (identifier))
      (expression
        (binary_expression
          (expression
            (identity_path
              (identifier)))
          (expression
            (identity_path
              (identifier))))))))

==================
Call function
==================

value(value=value)

---

(source_file
  (expression
    (function_call
      (expression
        (identity_path
          (identifier)))
      (dictionary_construction
        (dictionary_member_assignment
          (identifier)
          (expression
            (identity_path
              (identifier))))))))

==================
Call no arguments
==================

value()

---

(source_file
  (expression
    (function_call
      (expression
        (identity_path
          (identifier)))
      (dictionary_construction))))

==================
Call function deep in tree
==================

value.value(value=value)

---

(source_file
  (expression
    (function_call
      (expression
        (identity_path
          (identifier)
          (identifier)))
      (dictionary_construction
        (dictionary_member_assignment
          (identifier)
          (expression
            (identity_path
              (identifier))))))))

==================
Call method
==================

value::value(value=value)

---

(source_file
  (expression
    (method_call
      (expression
        (identity_path
          (identifier)))
      (identifier)
      (dictionary_construction
        (dictionary_member_assignment
          (identifier)
          (expression
            (identity_path
              (identifier))))))))

==================
Call method no arguments
==================

value::value()

---

(source_file
  (expression
    (method_call
      (expression
        (identity_path
          (identifier)))
      (identifier)
      (dictionary_construction))))

==================
Call method deep in tree
==================

value.value::value(value=value)

---

(source_file
  (expression
    (method_call
      (expression
        (identity_path
          (identifier)
          (identifier)))
      (identifier)
      (dictionary_construction
        (dictionary_member_assignment
          (identifier)
          (expression
            (identity_path
              (identifier))))))))

==================
Call method inside parenthasis
==================

(value::value())

---

(source_file
  (expression
    (parenthesis
      (expression
        (method_call
          (expression
            (identity_path
              (identifier)))
          (identifier)
          (dictionary_construction))))))

