==================
Empty
==================

()[] -> std.None {} 

---

(source_file
  (expression
    (closure_definition
      (void)
      (closure_captured_variables)
      (path
        (identifier)
        (identifier))
      (expression
        (procedural_block)))))

==================
Capture
==================

()[a, b, c] -> std.None {} 

---

(source_file
  (expression
    (closure_definition
      (void)
      (closure_captured_variables
        (identifier)
        (identifier)
        (identifier))
      (path
        (identifier)
        (identifier))
      (expression
        (procedural_block)))))

==================
Capture,
==================

()[a, b, c,] -> std.None {} 

---

(source_file
  (expression
    (closure_definition
      (void)
      (closure_captured_variables
        (identifier)
        (identifier)
        (identifier))
      (path
        (identifier)
        (identifier))
      (expression
        (procedural_block)))))

==================
With a statement
==================

()[] -> std.None {
  value = 5i;
} 

---

(source_file
  (expression
    (closure_definition
      (void)
      (closure_captured_variables)
      (path
        (identifier)
        (identifier))
      (expression
        (procedural_block
          (statement
            (assign
              (path
                  (identifier))
              (assignment_operator)
              (expression
                (signed_integer (integer (base_ten)))))))))))

==================
Call function
==================

value(value=value)

---

(source_file
  (expression
    (function_call
      (expression
        (path
          (identifier)))
      (dictionary_construction
        (dictionary_member_assignment
          (identifier)
          (expression
            (path
              (identifier))))))))

==================
Call no arguments
==================

value()

---

(source_file
  (expression
    (function_call
      (expression
        (path
          (identifier)))
      (void))))

==================
Call function deep in tree
==================

value.value(value=value)

---

(source_file
  (expression
    (function_call
      (expression
        (path
          (identifier)
          (identifier)))
      (dictionary_construction
        (dictionary_member_assignment
          (identifier)
          (expression
            (path
              (identifier))))))))

==================
Call method
==================

value:value(value=value)

---

(source_file
  (expression
    (method_call
      (expression
        (path
          (identifier)))
      (identifier)
      (dictionary_construction
        (dictionary_member_assignment
          (identifier)
          (expression
            (path
              (identifier))))))))

==================
Call method no arguments
==================

value:value()

---

(source_file
  (expression
    (method_call
      (expression
        (path
          (identifier)))
      (identifier)
      (void))))

==================
Call method deep in tree
==================

value.value:value(value=value)

---

(source_file
  (expression
    (method_call
      (expression
        (path
          (identifier)
          (identifier)))
      (identifier)
      (dictionary_construction
        (dictionary_member_assignment
          (identifier)
          (expression
            (path
              (identifier))))))))
