==================
Empty
==================

{} 

---

(source_file
  (expression
    (procedural_block)))

==================
Closed statement
==================

{
    5i;
} 

---

(source_file
  (expression
    (procedural_block
      (statement
        (closed_expression
          (expression
            (signed_integer (integer))))))))

==================
Open statement
==================

{
    5i
} 

---

(source_file
  (expression
    (procedural_block
      (statement
        (expression
          (signed_integer (integer)))))))

==================
Two open statements
==================

{
    5i 5i
} 

---

(source_file
  (expression
    (procedural_block
      (statement
        (expression
          (signed_integer (integer))))
      (statement
        (expression
          (signed_integer (integer)))))))

==================
If statement
==================

{
    if this {

    }

    5i
} 

---

(source_file
  (expression
    (procedural_block
      (statement
        (expression
          (if
            (expression
              (path
                (local_path
                  (identifier))))
            (procedural_block))))
      (statement
        (expression
          (signed_integer (integer)))))))