==================
Empty
==================

{} 

---

(source_file
  (expression
    (procedural_block)))

==================
Closed statement
==================

{
    5i;
} 

---

(source_file
  (expression
    (procedural_block
      (statement
        (closed_expression
          (expression
            (signed_integer (integer (base_ten)))))))))

==================
Open statement
==================

{
    5i
} 

---

(source_file
  (expression
    (procedural_block
      (statement
        (expression
          (signed_integer (integer (base_ten))))))))

==================
Two open statements
==================

{
    5i 5i
} 

---

(source_file
  (expression
    (procedural_block
      (statement
        (expression
          (signed_integer (integer (base_ten)))))
      (statement
        (expression
          (signed_integer (integer (base_ten))))))))

==================
If statement
==================

{
    if this {

    }

    5i
} 

---

(source_file
  (expression
    (procedural_block
      (statement
        (expression
          (if
            (expression
              (path
                (identifier)))
            (procedural_block))))
      (statement
        (expression
          (signed_integer (integer (base_ten))))))))
