==================
Empty
==================

[]

---

(source_file
  (expression
    (list)))

==================
Single
==================

[this,]

---

(source_file
  (expression
    (list
      (expression
        (identity_path
          (identifier))))))

==================
Multi
==================

[this, is, a, test]

---

(source_file
  (expression
    (list
      (expression
        (identity_path
          (identifier)))
      (expression
        (identity_path
          (identifier)))
      (expression
        (identity_path
          (identifier)))
      (expression
        (identity_path
          (identifier))))))

==================
Multi with comma at the end
==================

[this, is, a, test,]

---

(source_file
  (expression
    (list
      (expression
        (identity_path
          (identifier)))
      (expression
        (identity_path
          (identifier)))
      (expression
        (identity_path
          (identifier)))
      (expression
        (identity_path
          (identifier))))))
