==================
Empty
==================

()

---

(source_file
  (expression
    (dictionary_construction)))

==================
One
==================

( one: std.Constraint )

---

(source_file
  (expression
    (struct_definition
      (struct_member
        (identifier)
        (declaration_type
          (expression
            (member_access
              (expression
                (identifier))
              (identifier))))))))

==================
One,
==================

( one: std.Constraint, )

---

(source_file
  (expression
    (struct_definition
      (struct_member
        (identifier)
        (declaration_type
          (expression
            (member_access
              (expression
                (identifier))
              (identifier))))))))

==================
...
==================

( ... )

---

(source_file
  (expression
    (struct_definition
      (varadic_dots))))

==================
...,
==================

( ..., )

---

(source_file
  (expression
    (struct_definition
      (varadic_dots))))

==================
One, ...
==================

( one: std.Constraint, ... )

---

(source_file
  (expression
    (struct_definition
      (struct_member
        (identifier)
        (declaration_type
          (expression
            (member_access
              (expression
                (identifier))
              (identifier)))))
      (varadic_dots))))

==================
One, ...,
==================

( one: std.Constraint, ..., )

---

(source_file
  (expression
    (struct_definition
      (struct_member
        (identifier)
        (declaration_type
          (expression
            (member_access
              (expression
                (identifier))
              (identifier)))))
      (varadic_dots))))

==================
One, two
==================

( one: std.Constraint, two: std.Constraint )

---

(source_file
  (expression
    (struct_definition
      (struct_member
        (identifier)
        (declaration_type
          (expression
            (member_access
              (expression
                (identifier))
              (identifier)))))
      (struct_member
        (identifier)
        (declaration_type
          (expression
            (member_access
              (expression
                (identifier))
              (identifier))))))))

==================
One, two,
==================

( one: std.Constraint, two: std.Constraint, )

---

(source_file
  (expression
    (struct_definition
      (struct_member
        (identifier)
        (declaration_type
          (expression
            (member_access
              (expression
                (identifier))
              (identifier)))))
      (struct_member
        (identifier)
        (declaration_type
          (expression
            (member_access
              (expression
                (identifier))
              (identifier))))))))

==================
One, two, ...,
==================

( one: std.Constraint, two: std.Constraint, ..., )

---

(source_file
  (expression
    (struct_definition
      (struct_member
        (identifier)
        (declaration_type
          (expression
            (member_access
              (expression
                (identifier))
              (identifier)))))
      (struct_member
        (identifier)
        (declaration_type
          (expression
            (member_access
              (expression
                (identifier))
              (identifier)))))
      (varadic_dots))))

==================
Default
==================

( one: std.Constraint = a )

---

(source_file
  (expression
    (struct_definition
      (struct_member
        (identifier)
        (declaration_type
          (expression
            (member_access
              (expression
                (identifier))
              (identifier))))
        (expression
          (identifier))))))

==================
Default,
==================

( one: std.Constraint = a, )

---

(source_file
  (expression
    (struct_definition
      (struct_member
        (identifier)
        (declaration_type
          (expression
            (member_access
              (expression
                (identifier))
              (identifier))))
        (expression
          (identifier))))))
